Config/InformationRegisters/НастройкиПечатиПрефиксаНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатиПрефиксаНомера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбрезатьПрефикс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкиПечатиПрефиксаНомера/Forms/НастройкаПечатиПрефиксаНомераДокументов/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеПеречняДокументов();
	
	ОбщаяНастройка = ?(БиблиотекаФункцийОбменаПовтИсп.ПолучитьЗначениеОбщейНастройкиПечатиПрефиксаНомераДокумента() = Истина,1,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru='Данные были изменены, при закрытии формы все изменения будут утеряны. Сохранить изменения?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 10, КодВозвратаДиалога.Отмена,, КодВозвратаДиалога.Отмена);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьНастройки();
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ 

&НаКлиенте
Процедура ОбщаяНастройкаПриИзменении(Элемент)
	ОбработатьОбщееИзменениеНастройки(ОбщаяНастройка=1);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ МакетыПечатныхФорм

&НаКлиенте
Процедура ТаблицаОбъектовВидПечатиПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаОбъектов.ТекущиеДанные;
	Если ТекДанные.ВидПечати = 0 Тогда
		ТекДанные.РучнаяНастройка = Ложь;
		ТекДанные.ОбрезатьПрефикс = ОбщаяНастройка = 1;
	Иначе
		ТекДанные.РучнаяНастройка = Истина;
		ТекДанные.ОбрезатьПрефикс = ТекДанные.ВидПечати = 1;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СброситьНастройку(Команда)
	СброситьНастройкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если Модифицированность Тогда
		ЗаписатьНастройки();
		Модифицированность = Ложь;
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоУмолчанию(Команда)
	ОбновитьНаСервере(Истина);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СброситьНастройкуНаСервере()
	Для Каждого СтрТЧ Из ТаблицаОбъектов Цикл
		СтрТЧ.ОбрезатьПрефикс = ОбщаяНастройка = 1;
		СтрТЧ.ВидПечати = 0;
		СтрТЧ.РучнаяНастройка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	ТекТаблица = РеквизитФормыВЗначение("ТаблицаОбъектов");
	СтрОбщ = ТекТаблица.Добавить();
	СтрОбщ.ВидДокумента = ОбщегоНазначенияБГУПовтИсп.СсылкаИдентификатораОбъектаМетаданных("Документы");
	СтрОбщ.РучнаяНастройка = Ложь;
	СтрОбщ.ОбрезатьПрефикс = ОбщаяНастройка = 1;
	
	НаборЗаписей = РегистрыСведений.НастройкиПечатиПрефиксаНомера.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Загрузить(ТекТаблица);
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОбщееИзменениеНастройки(ЗначениеНастройки)
	ОбрабатываемыеСтроки = ТаблицаОбъектов.НайтиСтроки(Новый Структура("РучнаяНастройка",Ложь));
	
	Для Каждого СтрТЧ Из ОбрабатываемыеСтроки Цикл
		СтрТЧ.ОбрезатьПрефикс = ЗначениеНастройки;		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(НастройкаПоУмолчанию)
	РегистрыСведений.НастройкиПечатиПрефиксаНомера.ОбновитьПереченьДокументовНастройки(НастройкаПоУмолчанию);
	ЗаполнениеПеречняДокументов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПеречняДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПечатиПрефиксаНомера.ВидДокумента,
		|	НастройкиПечатиПрефиксаНомера.ОбрезатьПрефикс,
		|	ВЫБОР
		|		КОГДА НастройкиПечатиПрефиксаНомера.РучнаяНастройка
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК РучнаяНастройкаКартинка,
		|	ВЫБОР
		|		КОГДА НастройкиПечатиПрефиксаНомера.РучнаяНастройка
		|				И НастройкиПечатиПрефиксаНомера.ОбрезатьПрефикс
		|			ТОГДА 1
		|		КОГДА НастройкиПечатиПрефиксаНомера.РучнаяНастройка
		|				И НЕ НастройкиПечатиПрефиксаНомера.ОбрезатьПрефикс
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВидПечати,
		|	НастройкиПечатиПрефиксаНомера.РучнаяНастройка КАК РучнаяНастройка,
		|	НастройкиПечатиПрефиксаНомера.ВидДокумента.Наименование КАК ВидДокументаНаименование
		|ИЗ
		|	РегистрСведений.НастройкиПечатиПрефиксаНомера КАК НастройкиПечатиПрефиксаНомера
		|ГДЕ
		|	НЕ НастройкиПечатиПрефиксаНомера.ВидДокумента = &ГруппаДокументы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДокументаНаименование";
		
	Запрос.УстановитьПараметр("ГруппаДокументы", ОбщегоНазначенияБГУПовтИсп.СсылкаИдентификатораОбъектаМетаданных("Документы"));	

	Результат = Запрос.Выполнить();
	
	ТаблицаОбъектов.Загрузить(Результат.Выгрузить());	
	
КонецПроцедуры
